#%% (1) test
#제어 문자
# 반드시 따옴표 안에서 사용한다.
#\n : new Line 줄바꿈, 개행문자
#\t : tap 위 아래 줄 간격 맞춰 띄기
#\\ : \표현
#\" : " 표현
#\' : ' 표현


#큰 따옴표와 작은 따옴표의 차이는 없다.
#단, 작은 따옴표를 표현하고자 할 때 큰 따옴표로,
#큰 따옴표를 표현하고자 할 때 작은 따옴표로 사용한다.


#print("\"자기소개\"")
print('"자기소개"')
print("이름 : ", end= "")
print("강경표\n나이 : 26살")

#%% (2) task
# =============================================================================
# 애완동물 이름 : ???
# 애완동물 나이 : ???살
# 애완동물 몸무게 : ???kg
# 애완동물 혈액형 : ???
# 단, print()를 3번만 사용한다.
a = "*\n"
print("애완동물 이름 : 절미*\n애완동물 나이 : 1살", end = a)
print("애완동물 몸무게 : 5kg", end = a)
print("애완동물 혈액형 : A형", end = a)


# =============================================================================



